package project;

import java.util.Scanner;

public class Edit extends Search{
	
	public void start() { //회원정보 수정 일단은 기본적인 정보만 수정하도록 작성 완료.
		boolean botton = true;
		while(botton) { //회원정보검색
			System.out.println("------------------------------------------------------------------------------------------------------------------------");
			System.out.println("								회원 정보 수정  ");
			System.out.println("------------------------------------------------------------------------------------------------------------------------");
			int index = searchCustomer();
			if(index ==-3) break;
			edit(index);
			botton = Select.select12("메인메뉴로 돌아가시려면 1번 회원 정보 변경을 하시려면 2번을 입력해주세요.");
		}
	}
	
	
	public void edit(int index) {
		boolean botton = true;
		while(botton) {
			Scanner sc = new Scanner(System.in);
			System.out.println("수정하시려는 정보를 입력해주세요. \n 1. 이름 2. 생년월일 3. 전화번호 4. 주소"); 
			String reply = sc.next();
			switch(reply) {
			case "1": 
				Main.customerList.get(index).setName(); 
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println("								회원 정보 변경 완료 ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(" 이름   |  생년월일  |     전화번호          |      주소            |   등록 날짜        |   종료 날짜       |   수강 프로그램     |   등록 날짜        |  종료 날짜    ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(Main.customerList.get(index));
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				botton = !Select.select12("회원 정보가 수정되었습니다. 추가변경사항이 있으면 1번 아니면 2번을 입력해주세요.");
				break;
			case "2": 
				Main.customerList.get(index).setBirthday(); 
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println("								회원 정보 변경 완료 ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(" 이름   |  생년월일  |     전화번호          |      주소            |   등록 날짜        |   종료 날짜       |   수강 프로그램     |   등록 날짜        |  종료 날짜    ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");

				System.out.println(Main.customerList.get(index));
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				botton = !Select.select12("회원 정보가 수정되었습니다. 추가변경사항이 있으면 1번 아니면 2번을 입력해주세요.");
				break;
			case "3": 
				Main.customerList.get(index).setPhone(); 
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println("								회원 정보 변경 완료 ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(" 이름   |  생년월일  |     전화번호          |      주소            |   등록 날짜        |   종료 날짜       |   수강 프로그램     |   등록 날짜        |  종료 날짜    ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(Main.customerList.get(index));
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				botton = !Select.select12("회원 정보가 수정되었습니다. 추가변경사항이 있으면 1번 아니면 2번을 입력해주세요.");
				break;
			case "4": 
				Main.customerList.get(index).setAddress(); 
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println("								회원 정보 변경 완료 ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(" 이름   |  생년월일  |     전화번호          |      주소            |   등록 날짜        |   종료 날짜       |   수강 프로그램     |   등록 날짜        |  종료 날짜    ");
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				System.out.println(Main.customerList.get(index));
				System.out.println("------------------------------------------------------------------------------------------------------------------------");
				botton = !Select.select12("회원 정보가 수정되었습니다. 추가변경사항이 있으면 1번 아니면 2번을 입력해주세요.");
				break;
			default : System.out.println("잘못된 값을 입력했습니다. 다시 입력해주세요."); break;
			}
		}
	}
}
